import {ISalaryDict} from "../../server/components/dict/salary-dict.interface";

export const salaryDict: ISalaryDict[] = [
  {/*id: 1, */value: 'ППС', name: 'Профессорско-преподавательский состав', salary: 20120},// 1 ППС
  {/*id: 2, */value: 'НП', name: 'Научные работники', salary: 20120},// 2 НП
  {/*id: 3, */value: 'РП', name: 'Руководители структурных подразделений', salary: 20120},// 5 РП
  {/*id: 4, */value: 'ППС_В', name: 'УВЦ', salary: 20120},// УВЦ
  {/*id: 5, */value: 'ППС1', name: 'Педагогические работники', salary: 9220},// 6 Пед. работники
  
  // 7 УВП
  // 8 Работники спорта
  {/*id: 6, */value: 'АУП', name: 'Общеотраслевые специалисты и служащие', salary: 0},
  {/*id: 7, */value: 'АУП1', name: 'Общеотраслевые специалисты и служащие первого уровня', salary: 9600},
  {/*id: 8, */value: 'АУП2', name: 'Общеотраслевые специалисты и служащие второго уровня', salary: 9960},
  {/*id: 9, */value: 'АУП3', name: 'Общеотраслевые специалисты и служащие третьего уровня', salary: 11070},

  {/*id: 10,*/ value: 'ОП', name: 'Общеотраслевые профессии рабочих', salary: 0},
  {/*id: 11,*/ value: 'ОП1', name: 'Общеотраслевые профессии рабочих первого уровня', salary: 8500},
  {/*id: 12,*/ value: 'ОП2', name: 'Общеотраслевые профессии рабочих второго уровня', salary: 9600},
  {/*id: 13,*/ value: 'ИТП', name: 'Общеотраслевые специалисты и служащие третьего уровня', salary: 11070},
];
